import React, { useEffect, useState } from "react";
import styles from "./CreateStudentsClub.module.sass";
import projectLogo from "../../assets/project-logo.svg";
import Input from "../../components/Input/Input";
import Navbar from "../../components/Navbar/Navbar";
import axios from "axios";
import animalsImage from "../../assets/animals.png";
import Avatar from "../../components/Avatar/Avatar";
import { useNavigate } from "react-router-dom";

const clubCreate = `${import.meta.env.VITE_SERVER_URL}/api/students_clubs/create/`;
const userAPI = `${import.meta.env.VITE_SERVER_URL}/api/users/profile/`;

const CreateStudentsClub = () => {
    const navigate = useNavigate();

    const [title, setTitle] = useState("");
    const [type, setType] = useState("");
    const [description, setDescription] = useState("");
    const [contact, setContact] = useState("");
    const [userID, setUserID] = useState(0);
    const [imageSrc, setImageSrc] = useState(null);
    const userToken = JSON.parse(localStorage.getItem("userInfo")).token;
    const config = { headers: { Authorization: `Bearer ${userToken}` } };

    useEffect(() => {
        const getUser = async () => {
            try {
                const response = await axios.get(userAPI, config);
                setUserID(response.data.user_id);
            } catch (error) {
                console.log("Failed fetching", error);
            }
        };
        getUser();
    }, []);


    const [inputErrors, setInputErrors] = useState({
        title: "",
        type: "",
        description: "",
        contact: "",
    });


    const validateForm = () => {
        const errors = {};

        if (!title) {
            errors.title = "Введите название проекта";
        }

        if (!type) {
            errors.type = "Выберите тип проекта";
        }

        if (!description) {
            errors.description = "Введите описание проекта";
        }

        if (!contact) {
            errors.contact = "Введите контактные данные";
        }

        setInputErrors(errors);

        return Object.keys(errors).length === 0;
    };

    const handleSubmit = (event) => {

        event.preventDefault();
        if (validateForm()) {
            const formData = new FormData();
            formData.append("title", title);
            formData.append("description", description);
            formData.append("related_by_uni", type);
            formData.append("contact", contact);
            formData.append("author_id", userID);
            formData.append("image_src", imageSrc);
            formData.append("members", "");
            axios
                .post(clubCreate, formData)
                .then(function (response) {
                    navigate(`/students-club/${response.data.students_club_id}`, response.data);

                })
                .catch(function (error) {
                    console.log(error);
                });
        };
    }

    return (
        <>
            <Navbar />
            <div className={styles.container}>
                <div className={styles.header}>

                    <h2 className={styles.header__title}>Создание студенческого клуба</h2>
                </div>
                <p className={styles.subheader}>
                    Создайте собственный студенческий клуб и найдите единомышленников
                </p>
                <form className={styles.form} onSubmit={handleSubmit}>
                    <div className={styles.form__header}>
                        <Avatar setImageSrc={setImageSrc} />
                        <div className={styles.form__header__inputs}>
                            <div className={styles.input__wrapper}>
                                <Input
                                    placeholder="Название клуба"
                                    type="text"
                                    name="text"
                                    id="clubName"
                                    value={title}
                                    onChange={(event) => setTitle(event.target.value)}
                                    maxlength="100"
                                    error={inputErrors.title}
                                />
                            </div>

                            <div className={styles.input__wrapper}>

                                <select
                                    className={`${styles.input__wrapper} ${styles.select}`}
                                    value={type}
                                    onChange={(event) => setType(event.target.value)}
                                >
                                    <option value="" disabled hidden>
                                        Укажите университет или без него
                                    </option>
                                    <option value="false">
                                        Без университета
                                    </option>
                                    <option value="Казахский национальный университет имени Аль-Фараби">Казахский национальный университет имени Аль-Фараби</option>
                                     <option value="Евразийский национальный университет имени Л.Н. Гумилева">Евразийский национальный университет имени Л.Н. Гумилева</option>
                                     <option value="Казахская национальная академия искусств имени Т. Жургенова">Казахская национальная академия искусств имени Т. Жургенова</option>
                                     <option value="Казахский национальный аграрный университет">Казахский национальный аграрный университет</option>
                                     <option value="Казахский национальный исследовательский технический университет им. К.И. Сатпаева">Казахский национальный исследовательский технический университет им. К.И. Сатпаева</option>
                                     <option value="Казахская национальная академия хореографии">Казахская национальная академия хореографии</option>
                                     <option value="Казахская национальная консерватория имени Курмангазы">Казахская национальная консерватория имени Курмангазы</option>
                                     <option value="Казахский национальный женский педагогический университет">Казахский национальный женский педагогический университет</option>
                                     <option value="Казахский национальный медицинский университет имени С.Д. Асфендиярова">Казахский национальный медицинский университет имени С.Д. Асфендиярова</option>
                                     <option value="Казахский национальный педагогический университет имени Абая">Казахский национальный педагогический университет имени Абая</option>
                                     <option value="Казахский национальный университет искусств">Казахский национальный университет искусств</option>
                                     <option value="Актюбинский региональный университет имени К. Жубанова">Актюбинский региональный университет имени К. Жубанова</option>
                                     <option value="Аркалыкский педагогический институт имени И. Алтынсарина">Аркалыкский педагогический институт имени И. Алтынсарина</option>
                                     <option value="Атырауский университет имени Х. Досмухамедова">Атырауский университет имени Х. Досмухамедова</option>
                                     <option value="Атырауский университет нефти и газа им. С. Утебаева">Атырауский университет нефти и газа им. С. Утебаева</option>
                                     <option value="Восточно-Казахстанский технический университет имени Д. Серикбаева">Восточно-Казахстанский технический университет имени Д. Серикбаева</option>
                                     <option value="Восточно-Казахстанский университет имени С. Аманжолова">Восточно-Казахстанский университет имени С. Аманжолова</option>
                                     <option value="Медицинский университет Семей">Медицинский университет Семей</option>
                                     <option value="Жетысуский университет имени И. Жансугурова">Жетысуский университет имени И. Жансугурова</option>
                                     <option value="Западно-Казахстанский аграрно-технический университет имени Жангир хана">Западно-Казахстанский аграрно-технический университет имени Жангир хана</option>
                                     <option value="Западно-Казахстанский университет имени М. Утемисова">Западно-Казахстанский университет имени М. Утемисова</option>
                                     <option value="Западно-Казахстанский медицинский университет имени М. Оспанова">Западно-Казахстанский медицинский университет имени М. Оспанова</option>
                                     <option value="Карагандинский индустриальный университет">Карагандинский индустриальный университет</option>
                                     <option value="Медицинский университет Караганды">Медицинский университет Караганды</option>
                                     <option value="Карагандинский технический университет">Карагандинский технический университет</option>
                                     <option value="Карагандинский университет имени академика E. Букетова">Карагандинский университет имени академика E. Букетова</option>
                                     <option value="Кокшетауский университет имени Ш. Уалиханова">Кокшетауский университет имени Ш. Уалиханова</option>
                                     <option value="Костанайский региональный университет имени А. Байтурсынова">Костанайский региональный университет имени А. Байтурсынова</option>
                                     <option value="Кызылординский университет имени Коркыт Ата">Кызылординский университет имени Коркыт Ата</option>
                                     <option value="Павлодарский педагогический университет">Павлодарский педагогический университет</option>
                                     <option value="Павлодарский университет имени С. Торайгырова">Павлодарский университет имени С. Торайгырова</option>
                                     <option value="Рудненский индустриальный институт">Рудненский индустриальный институт</option>
                                     <option value="Северо-Казахстанский университет имени М. Козыбаева">Северо-Казахстанский университет имени М. Козыбаева</option>
                                     <option value="Таразский региональный университет имени М. Дулати">Таразский региональный университет имени М. Дулати</option>
                                     <option value="Университет Шакарима">Университет Шакарима</option>
                                     <option value="Южно-Казахстанский государственный педагогический университет">Южно-Казахстанский государственный педагогический университет</option>
                                     <option value="Южно-Казахстанский университет имени М. Ауэзова">Южно-Казахстанский университет имени М. Ауэзова</option>
                                     <option value="Каспийский университет технологии и инжиниринга имени Ш. Есенова">Каспийский университет технологии и инжиниринга имени Ш. Есенова</option>
                                     <option value="Академия гражданской авиации">Академия гражданской авиации</option>
                                     <option value="Алматинский технологический университет">Алматинский технологический университет</option>
                                     <option value="Алматинский университет энергетики и связи имени Г. Даукеева">Алматинский университет энергетики и связи имени Г. Даукеева</option>
                                     <option value="Казахская академия спорта и туризма">Казахская академия спорта и туризма</option>
                                     <option value="Казахский агротехнический университет имени С. Сейфуллина">Казахский агротехнический университет имени С. Сейфуллина</option>
                                     <option value="Казахский университет международных отношений и мировых языков имени Абылай хана">Казахский университет международных отношений и мировых языков имени Абылай хана</option>
                                     <option value="Казахстанско-Британский технический университет">Казахстанско-Британский технический университет</option>
                                     <option value="Международный университет информационных технологий">Международный университет информационных технологий</option>
                                     <option value="Университет КАЗГЮУ имени М. Нарикбаева">Университет КАЗГЮУ имени М. Нарикбаева</option>
                                     <option value="Южно-Казахстанская медицинская академия">Южно-Казахстанская медицинская академия</option>
                                     <option value="Медицинский университет Астана">Медицинский университет Астана</option>
                                     <option value="Университет КИМЭП">Университет КИМЭП</option>
                                     <option value="Международная образовательная корпорация">Международная образовательная корпорация</option>
                                     <option value="Университет Нархоз">Университет Нархоз</option>
                                     <option value="Жезказганский университет имени О.А. Байконурова">Жезказганский университет имени О.А. Байконурова</option>
                                     <option value="Международный казахско-турецкий университет имени Х. Ясави">Международный казахско-турецкий университет имени Х. Ясави</option>
                                     <option value="Актауский гуманитарно-технический университет">Актауский гуманитарно-технический университет</option>
                                     <option value="Алматы Менеджмент университет">Алматы Менеджмент университет</option>
                                     <option value="Астана IT университет">Астана IT университет</option>
                                     <option value="Каспийский общественный университет">Каспийский общественный университет</option>
                                     <option value="Академия «Болашак»">Академия «Болашак»</option>
                                     <option value="Академия «Кайнар»">Академия «Кайнар»</option>
                                     <option value="Баишев Университет">Баишев Университет</option>
                                     <option value="Алматинская академия экономики и статистики">Алматинская академия экономики и статистики</option>
                                     <option value="Атырауский инженерно-гуманитарный институт">Атырауский инженерно-гуманитарный институт</option>
                                     <option value="Гуманитарно-техническая академия">Гуманитарно-техническая академия</option>
                                     <option value="Гуманитарно-технический институт «Акмешит»">Гуманитарно-технический институт «Акмешит»</option>
                                     <option value="Евразийская юридическая академия имени Д. Кунаева">Евразийская юридическая академия имени Д. Кунаева</option>
                                     <option value="Евразийский гуманитарный институт">Евразийский гуманитарный институт</option>
                                     <option value="Евразийский технологический университет">Евразийский технологический университет</option>
                                     <option value="Египетский университет исламской культуры «Нур-Мубарак»">Египетский университет исламской культуры «Нур-Мубарак»</option>
                                     <option value="Екибастузский инженерно-технический институт имени академика К. Сатпаева">Екибастузский инженерно-технический институт имени академика К. Сатпаева</option>
                                     <option value="Западно-Казахстанский инновационно-технологический университет">Западно-Казахстанский инновационно-технологический университет</option>
                                     <option value="Инновационный Евразийский университет">Инновационный Евразийский университет</option>
                                     <option value="Казахский автомобильно-дорожный институт им. Л.Б. Гончарова">Казахский автомобильно-дорожный институт им. Л.Б. Гончарова</option>
                                     <option value="Казахская академия труда и социальных отношений">Казахская академия труда и социальных отношений</option>
                                     <option value="Казахский гуманитарно-юридический инновационный университет">Казахский гуманитарно-юридический инновационный университет</option>
                                     <option value="Казахский университет путей сообщения">Казахский университет путей сообщения</option>
                                     <option value="Казахский университет технологии и бизнеса">Казахский университет технологии и бизнеса</option>
                                     <option value="Казахский университет экономики, финансов и международной торговли">Казахский университет экономики, финансов и международной торговли</option>
                                     <option value="Казахско-Русский Международный университет">Казахско-Русский Международный университет</option>
                                     <option value="Университет Дружбы народов им. А. Куатбекова">Университет Дружбы народов им. А. Куатбекова</option>
                                     <option value="Казахстанский инженерно-технологический университет">Казахстанский инженерно-технологический университет</option>
                                     <option value="Казахстанская инновационная академия">Казахстанская инновационная академия</option>
                                     <option value="Казахстанский университет инновационных и телекоммуникационных систем">Казахстанский университет инновационных и телекоммуникационных систем</option>
                                     <option value="Казахстанско-Американский свободный университет">Казахстанско-Американский свободный университет</option>
                                     <option value="Казахстанско-Немецкий университет">Казахстанско-Немецкий университет</option>
                                     <option value="Карагандинский университет Казпотребсоюза">Карагандинский университет Казпотребсоюза</option>
                                     <option value="Кокшетауский университет имени А. Мырзахметова">Кокшетауский университет имени А. Мырзахметова</option>
                                     <option value="Костанайский инженерно-экономический университет имени М. Дулатова">Костанайский инженерно-экономический университет имени М. Дулатова</option>
                                     <option value="Костанайский социально-технический университет имени академика З. Алдамжар">Костанайский социально-технический университет имени академика З. Алдамжар</option>
                                     <option value="Международный университет «Астана»">Международный университет «Астана»</option>
                                     <option value="Международный Университет SILKWAY">Международный Университет SILKWAY</option>
                                     <option value="Международный университет туризма и гостеприимства">Международный университет туризма и гостеприимства</option>
                                     <option value="Таразский инновационно-гуманитарный университет">Таразский инновационно-гуманитарный университет</option>
                                     <option value="Университет «Астана»">Университет «Астана»</option>
                                     <option value="Университет «Болашак»">Университет «Болашак»</option>
                                     <option value="Университет «Сырдария»">Университет «Сырдария»</option>
                                     <option value="Университет «Туран»">Университет «Туран»</option>
                                     <option value="Университет «Туран-Астана»">Университет «Туран-Астана»</option>
                                     <option value="Университет Алматы">Университет Алматы</option>
                                     <option value="Университет имени Сулеймана Демиреля">Университет имени Сулеймана Демиреля</option>
                                     <option value="Университет иностранных языков и деловой карьеры">Университет иностранных языков и деловой карьеры</option>
                                     <option value="Университет международного бизнеса">Университет международного бизнеса</option>
                                     <option value="Университет Мирас">Университет Мирас</option>
                                     <option value="Центрально-Азиатский университет">Центрально-Азиатский университет</option>
                                     <option value="Центрально-Казахстанская Академия">Центрально-Казахстанская Академия</option>
                                     <option value="Шымкентский Университет">Шымкентский Университет</option>
                                     <option value="Казахский медицинский университет непрерывного образования">Казахский медицинский университет непрерывного образования</option>
                                     <option value="Казахстанско-Российский медицинский университет">Казахстанско-Российский медицинский университет</option>
                                     <option value="Казахстанский медицинский университет «Высшая школа общественного здравоохранения»">Казахстанский медицинский университет «Высшая школа общественного здравоохранения»</option>
                                     <option value="Центрально-Азиатский инновационный университет">Центрально-Азиатский инновационный университет</option>
                                     <option value="Академия логистики и транспорта">Академия логистики и транспорта</option>


                                    <option value="Другое">Другое</option>
                                </select>
                                {inputErrors.type && <p className={styles.input__error}>{inputErrors.type}</p>}
                            </div>
                        </div>
                    </div>
                    <textarea
                        className={styles.textarea}
                        placeholder="Описание"
                        value={description}
                        onChange={(event) => setDescription(event.target.value)}
                        maxLength="800"
                    />
                    {inputErrors.description && <p className={styles.input__error}>{inputErrors.description}</p>}
                    <div className={styles.form__contacts}>
                        <p className={styles.contacts__header}>Контакты</p>
                        <div className={styles.contacts__info}>
                            <img className={styles.contacts__image} src={animalsImage} />
                            <div className={styles.contacts__actions}>
                                <div className={styles.input__wrapper}>
                                    <Input
                                        placeholder="Впиши любой контакт"
                                        type="text"
                                        name="text"
                                        id="clubContact"
                                        value={contact}
                                        onChange={(event) => setContact(event.target.value)}
                                        maxlength="100"
                                        error={inputErrors.contact}
                                    />
                                </div>
                                <button className={styles.form__button} type="submit">
                                    Создать
                                </button>
                            </div>
                        </div>
                    </div>
                </form>
            </div>
        </>
    );
};

export default CreateStudentsClub;
